{"list": [
          {
          "name": "Kiev",
          "countryCode": "UA",
          "details": "The city's name is said to derive from the name of Kyi, one of its four legendary founders. During its history, Kiev, one of the oldest cities in Eastern Europe, passed through several stages of great prominence and relative obscurity. The city probably existed as a commercial centre as early as the 5th century. A Slavic settlement on the great trade route between Scandinavia and Constantinople, Kiev was a tributary of the Khazars, until seized by the Varangians (Vikings) in the mid-9th century. Under Varangian rule, the city became a capital of the Kievan Rus', the first East Slavic state. Completely destroyed during the Mongol invasion in 1240, the city lost most of its influence for the centuries to come. It was a provincial capital of marginal importance in the outskirts of the territories controlled by its powerful neighbours; first the Grand Duchy of Lithuania, followed by Poland and Russia."
          },
          {
          "name": "Odessa",
          "countryCode": "UA",
          "details": "The predecessor of Odessa, a small Tatar settlement, was founded by Hacı I Giray, the Khan of Crimea, in 1440 and originally named after him as \"Hacıbey\". After a period of Lithuanian control, it passed into the domain of the Ottoman Sultan in 1529 and remained in Ottoman hands until the Ottoman Empire's defeat in the Russo-Turkish War of 1792. In 1794, the city of Odessa was founded by a decree of the Empress Catherine the Great. From 1819 to 1858, Odessa was a free port. During the Soviet period it was the most important port of trade in the Soviet Union and a Soviet naval base. On 1 January 2000, the Quarantine Pier at Odessa Commercial Sea Port was declared a free port and free economic zone for a period of 25 years. During the 19th century, it was the fourth largest city of Imperial Russia, after Moscow, Saint Petersburg and Warsaw. Its historical architecture has a style more Mediterranean than Russian, having been heavily influenced by French and Italian styles. Some buildings are built in a mixture of different styles, including Art Nouveau, Renaissance and Classicist."
          },
          {
          "name": "Minsk",
          "countryCode": "BY",
          "details": "Minsk (Belarusian: Мінск, pronounced [mʲinsk]; Russian: Минск, [mʲinsk]), is the capital and largest city of Belarus, on the Svislach and the Nyamiha Rivers. As the national capital, Minsk has a special administrative status in Belarus and is the administrative centre of Minsk Region (voblast) and Minsk raion (district). In 2013, it had a population of 2,002,600. Minsk is the administrative capital of the Commonwealth of Independent States (CIS) and seat of the Executive Secretary. The earliest historical references to Minsk date to the 11th century (1067), when it was noted as a provincial city within the Principality of Polotsk. The settlement developed on the rivers. In 1242, Minsk became part of the Grand Duchy of Lithuania. It received town privileges in 1499. From 1569, it was a capital of the Minsk Voivodeship, in the Polish–Lithuanian Commonwealth. It was part of a region annexed by the Russian Empire in 1793, as a consequence of the Second Partition of Poland. From 1919 to 1991, after the Russian Revolution, Minsk was the capital of the Byelorussian Soviet Socialist Republic in the Soviet Union. Minsk will host the 2019 European Games."
          },
          {
          "name": "Brest",
          "countryCode": "BY",
          "details": "Brest (Belarusian: Брэст Brest, Russian: Брест Brest), formerly Brest-Litovsk (Belarusian: Брэст-Лiтоўск) and Brest-on-the-Bug (Polish: Brześć nad Bugiem), is a city (population 340,141 in 2016) in Belarus at the border with Poland opposite the Polish city of Terespol, where the Bug and Mukhavets rivers meet. It is the capital city of the Brest Region. The city of Brest is a historic site of many cultures. It was the location of important historical events such as the Union of Brest and Treaty of Brest-Litovsk. The Brest Fortress was recognized by the Soviet Union as the Hero Fortress in honor of the defense of Brest Fortress in June 1941.  During medieval times, the city was part of the Kingdom of Poland from 1020 until 1319 when it was taken by the Grand Duchy of Lithuania. It became part of the Polish–Lithuanian Commonwealth in 1569. As a result of the Partitions of Poland, it was incorporated into the Russian Empire in 1795. After World War I, the city returned to Second Polish Republic. During the Invasion of Poland by Nazi Germany and the Soviet Union in 1939 the city was first captured by the Wehrmacht and soon passed on to the USSR in accordance with German–Soviet Frontier Treaty. In 1941 it was taken again by the Nazis during Operation Barbarossa. After the war, once the new boundaries between the USSR and Poland were ratified, the city became part of the Soviet BSSR until the breakup of the country in 1991. It is part of sovereign Belarus of today."
          },
          {
          "name": "London",
          "countryCode": "UK",
          "details": "Standing on the River Thames in the south east of the island of Great Britain, London has been a major settlement for two millennia. It was founded by the Romans, who named it Londinium. London's ancient core, the City of London, largely retains its 1.12-square-mile (2.9 km2) medieval boundaries. Since at least the 19th century, \"London\" has also referred to the metropolis around this core, historically split between Middlesex, Essex, Surrey, Kent, and Hertfordshire, which today largely makes up Greater London, a region governed by the Mayor of London and the London Assembly.] London is a leading global city in the arts, commerce, education, entertainment, fashion, finance, healthcare, media, professional services, research and development, tourism, and transportation. It is crowned as the world's largest financial centre and has the fifth- or sixth-largest metropolitan area GDP in the world. London is a world cultural capital. It is the world's most-visited city as measured by international arrivals and has the world's largest city airport system measured by passenger traffic. London is the world's leading investment destination, hosting more international retailers and ultra high-net-worth individuals than any other city. London's universities form the largest concentration of higher education institutes in Europe. In 2012, London became the first city to have hosted the modern Summer Olympic Games three times."
          },
          {
          "name": "Berlin",
          "countryCode": "DE",
          "details": "Berlin (/bɜːrˈlɪn, ˌbɜːr-/, German: [bɛɐ̯ˈliːn] (About this sound listen)) is the capital and the largest city of Germany as well as one of its 16 constituent states. With a population of approximately 3.7 million, Berlin is the second most populous city proper in the European Union and the seventh most populous urban area in the European Union. Located in northeastern Germany on the banks of the rivers Spree and Havel, it is the centre of the Berlin-Brandenburg Metropolitan Region, which has roughly 6 million residents from more than 180 nations. Due to its location in the European Plain, Berlin is influenced by a temperate seasonal climate. Around one-third of the city's area is composed of forests, parks, gardens, rivers, canals and lakes. First documented in the 13th century and situated at the crossing of two important historic trade routes, Berlin became the capital of the Margraviate of Brandenburg (1417–1701), the Kingdom of Prussia (1701–1918), the German Empire (1871–1918), the Weimar Republic (1919–1933) and the Third Reich (1933–1945). Berlin in the 1920s was the third largest municipality in the world. After World War II and its subsequent occupation by the victorious countries, the city was divided; East Berlin was declared capital of East Germany, while West Berlin became a de facto West German exclave, surrounded by the Berlin Wall (1961–1989) and East German territory. Following German reunification in 1990, Berlin once again became the capital of all of Germany."
          },
          {
          "name": "Milan",
          "countryCode": "IT",
          "details": "Milan (English: /mɪˈlæn/ or US: /mɪˈlɑːn/; Italian: Milano [miˈlaːno] (About this sound listen); Lombard: Milan [miˈlãː] (Milanese variant)) is the city capital of the Lombardy Region in Northern Italy and is the 2nd richest city in the European Union after Paris in 2016.It is the second most populous city in Italy after Rome, with the city proper having a population of 1,369,000 (the Metropolitan City of Milan has a population of 3,219,000). Its geographical outskirt (that stretches beyond the boundaries of the Metropolitan City of Milan), has a population estimated to be about 5,270,000 in 1,891 square kilometres (730 square miles), ranking 2nd in the European Union. The wider Milan metropolitan area, popular for Greater Milan, is a polycentric metropolitan region that comprehends almost every province of Lombardy, the Piedmont province of Novara, and some parts of the province of Piacenza which counts an estimated total population of 8,123,020. Milan is Italy's main industrial and financial capital and corporation hub home to thousands of the most important companies worldwide. In terms of GDP, it has the largest economy among European non-capital cities. Milan is considered part of the Blue Banana and has now become the wealthiest city among the economic rivalry \"Four Motors for Europe.\""
          },
          {
          "name": "Paris",
          "countryCode": "FR",
          "details": "Paris (locally [pɑʁi] (About this sound listen)) is the capital and most populous city of France, with an administrative-limits area of 105 square kilometres (41 square miles) and a 2015 population of 2,229,621. The city is a commune and department, and the capital-heart of the 12,012-square-kilometre (4,638-square-mile) Île-de-France region (colloquially known as the 'Paris Region'), whose 12,142,802 2016 population represents roughly 18 percent of the population of France. By the 17th century, Paris had become one of Europe's major centres of finance, commerce, fashion, science, and the arts, a position that it retains still today. The Paris Region had a GDP of €649.6 billion (US $763.4 billion) in 2014, accounting for 30.4 percent of the GDP of France. According to official estimates, in 2013-14 the Paris Region had the third-highest GDP in the world and the largest regional GDP in the EU. The City of Paris' administrative limits form a horizontal oval centred on its historical-heart Île de la Cité island; this island is near the peak of an arc of Seine river that divides the city into southern Rive Gauche (Left Bank) and northern Rive Droite regions. Paris is but the core of a built-up area that extends well beyond its limits: commonly referred to as the agglomération Parisienne, and statistically as a unité urbaine (a measure of urban area), the Paris agglomeration's 10,601,122 2013 population makes it the largest urban area in the European Union. City-influenced commuter activity reaches well beyond even this in a statistical aire urbaine de Paris (a measure of metropolitan area), that had a 2013 population of 12,405,426, a number one-fifth the population of France, and one that makes it, after London, the second largest metropolitan area in the European Union. The 2016 Metropole of Grand Paris initiative, encompassing the City of Paris and its surrounding petite couronne department communes, or area covering 814 square kilometers and representing a population of 7 million, aims to improve city-suburb cooperation through a unique governing body."
          },
          {
          "name": "Vienna",
          "countryCode": "AT",
          "details": "Vienna (/viˈɛnə/ (About this sound listen);[9][10] German: Wien, pronounced [viːn] (About this sound listen)) is the capital and largest city of Austria and one of the nine states of Austria. Vienna is Austria's primary city, with a population of about 1.8 million (2.6 million within the metropolitan area, nearly one third of Austria's population), and its cultural, economic, and political centre. It is the 7th-largest city by population within city limits in the European Union. Until the beginning of the 20th century, it was the largest German-speaking city in the world, and before the splitting of the Austro-Hungarian Empire in World War I, the city had 2 million inhabitants. Today, it has the second largest number of German speakers after Berlin. Vienna is host to many major international organizations, including the United Nations and OPEC. The city is located in the eastern part of Austria and is close to the borders of the Czech Republic, Slovakia, and Hungary. These regions work together in a European Centrope border region. Along with nearby Bratislava, Vienna forms a metropolitan region with 3 million inhabitants.[citation needed] In 2001, the city centre was designated a UNESCO World Heritage Site. In July 2017 it was moved to the list of World Heritage in Danger.  Apart from being regarded as the City of Music because of its musical legacy, Vienna is also said to be \"The City of Dreams\" because it was home to the world's first psycho-analyst – Sigmund Freud. The city's roots lie in early Celtic and Roman settlements that transformed into a Medieval and Baroque city, and then the capital of the Austro-Hungarian Empire. It is well known for having played an essential role as a leading European music centre, from the great age of Viennese Classicism through the early part of the 20th century. The historic centre of Vienna is rich in architectural ensembles, including Baroque castles and gardens, and the late-19th-century Ringstraße lined with grand buildings, monuments and parks."
          },
          
    
]}
